chenwangqing/Coroutine/Keil/HC32F103/LIB/HC32F10x_StdPeriph_Driver/src/hc32f10x_can.c
  /* Select one empty transmit mailbox */
  if ((CAN_TSR(CANx)&CAN_TSR_TME0) == CAN_TSR_TME0)
  {
    transmit_mailbox = 0;
  }
  else if ((CAN_TSR(CANx)&CAN_TSR_TME1) == CAN_TSR_TME1)
  {
    transmit_mailbox = 1;
  }
  else if ((CAN_TSR(CANx)&CAN_TSR_TME2) == CAN_TSR_TME2)
  {
    transmit_mailbox = 2;
  }
  else
  {
    transmit_mailbox = CAN_TxStatus_NoMailBox;
  }

  if (transmit_mailbox != CAN_TxStatus_NoMailBox)
  {
		*(__IO uint32_t*)(CANx + CAN_TIR_OFFSET_BASE + transmit_mailbox * 0x10) &= TMIDxR_TXRQ;
    if (TxMessage->IDE == CAN_Id_Standard)
    { 
      *(__IO uint32_t*)(CANx + CAN_TIR_OFFSET_BASE + transmit_mailbox * 0x10) |= ((TxMessage->StdId << 21) | TxMessage->RTR);
    }
    else
    {
      *(__IO uint32_t*)(CANx + CAN_TIR_OFFSET_BASE + transmit_mailbox * 0x10) |= ((TxMessage->ExtId << 3) | TxMessage->IDE | TxMessage->RTR);
    }
    
    /* Set up the DLC */
    TxMessage->DLC &= (uint8_t)0x0000000F;
    *(__IO uint32_t*)(CANx + CAN_TDTR_OFFSET_BASE + transmit_mailbox * 0x10) &= (uint32_t)0xFFFFFFF0;
    *(__IO uint32_t*)(CANx + CAN_TDTR_OFFSET_BASE + transmit_mailbox * 0x10) |= TxMessage->DLC;

    /* Set up the data field */
    *(__IO uint32_t*)(CANx + CAN_TDLR_OFFSET_BASE + transmit_mailbox * 0x10) = 
																						 (((uint32_t)TxMessage->Data[3] << 24) | 
                                             ((uint32_t)TxMessage->Data[2] << 16) |
                                             ((uint32_t)TxMessage->Data[1] << 8) | 
                                             ((uint32_t)TxMessage->Data[0]));
    *(__IO uint32_t*)(CANx + CAN_TDHR_OFFSET_BASE + transmit_mailbox * 0x10) = 
																							(((uint32_t)TxMessage->Data[7] << 24) | 
                                             ((uint32_t)TxMessage->Data[6] << 16) |
                                             ((uint32_t)TxMessage->Data[5] << 8) |
                                             ((uint32_t)TxMessage->Data[4]));
    /* Request transmission */
    *(__IO uint32_t*)(CANx + CAN_TIR_OFFSET_BASE + transmit_mailbox * 0x10) |= TMIDxR_TXRQ;
  }
  return transmit_mailbox;
}

/**
  * @brief  Checks the transmission of a message.
  * @param  CANx:            where x can be 1 or 2 to to select the 
  *                          CAN peripheral.
  * @param  TransmitMailbox: the number of the mailbox that is used for 
  *                          transmission.
  * @retval CAN_TxStatus_Ok if the CAN driver transmits the message, CAN_TxStatus_Failed 
  *         in an other case.
  */
uint8_t CAN_TransmitStatus(uint32_t CANx, uint8_t TransmitMailbox)
{
  uint32_t state = 0;

  switch (TransmitMailbox)
  {
    case (CAN_TXMAILBOX_0): 
      state =   CAN_TSR(CANx) &  (CAN_TSR_RQCP0 | CAN_TSR_TXOK0 | CAN_TSR_TME0);
      break;
    case (CAN_TXMAILBOX_1): 
      state =   CAN_TSR(CANx) &  (CAN_TSR_RQCP1 | CAN_TSR_TXOK1 | CAN_TSR_TME1);
      break;
    case (CAN_TXMAILBOX_2): 
      state =   CAN_TSR(CANx) &  (CAN_TSR_RQCP2 | CAN_TSR_TXOK2 | CAN_TSR_TME2);
      break;
    default:
      state = CAN_TxStatus_Failed;
      break;
  }
  switch (state)
  {
      /* transmit pending  */
    case (0x0): state = CAN_TxStatus_Pending;
      break;
      /* transmit failed  */
     case (CAN_TSR_RQCP0 | CAN_TSR_TME0): state = CAN_TxStatus_Failed;
      break;
     case (CAN_TSR_RQCP1 | CAN_TSR_TME1): state = CAN_TxStatus_Failed;
      break;
     case (CAN_TSR_RQCP2 | CAN_TSR_TME2): state = CAN_TxStatus_Failed;
      break;
      /* transmit succeeded  */
    case (CAN_TSR_RQCP0 | CAN_TSR_TXOK0 | CAN_TSR_TME0):state = CAN_TxStatus_Ok;
      break;
    case (CAN_TSR_RQCP1 | CAN_TSR_TXOK1 | CAN_TSR_TME1):state = CAN_TxStatus_Ok;
      break;
    case (CAN_TSR_RQCP2 | CAN_TSR_TXOK2 | CAN_TSR_TME2):state = CAN_TxStatus_Ok;
      break;
    default: state = CAN_TxStatus_Failed;
      break;
  }
  return (uint8_t) state;
}

/**
  * @brief  Cancels a transmit request.
  * @param  CANx:     where x can be 1 or 2 to to select the CAN peripheral. 
  * @param  Mailbox:  Mailbox number.
  * @retval None.
  */
void CAN_CancelTransmit(uint32_t CANx, uint8_t Mailbox)
{
  /* abort transmission */
  switch (Mailbox)
  {
    case (CAN_TXMAILBOX_0): CAN_TSR(CANx) |= CAN_TSR_ABRQ0;
      break;
    case (CAN_TXMAILBOX_1): CAN_TSR(CANx) |= CAN_TSR_ABRQ1;
      break;
    case (CAN_TXMAILBOX_2): CAN_TSR(CANx) |= CAN_TSR_ABRQ2;
      break;
    default:
      break;
  }
}


/**
  * @brief  Receives a message.
  * @param  CANx:       where x can be 1 or 2 to to select the CAN peripheral.
  * @param  FIFONumber: Receive FIFO number, CAN_FIFO0 or CAN_FIFO1.
  * @param  RxMessage:  pointer to a structure receive message which contains 
  *                     CAN Id, CAN DLC, CAN datas and FMI number.
  * @retval None.
  */
void CAN_Receive(uint32_t CANx, uint8_t FIFONumber, CanRxMsg* RxMessage)
{
 /* Get the Id */
  RxMessage->IDE = (uint8_t)0x04 & (*(__IO uint32_t*)(CANx + CAN_RIR_OFFSET_BASE + FIFONumber * 0x10));
  if (RxMessage->IDE == CAN_Id_Standard)
  {
    RxMessage->StdId = (uint32_t)0x000007FF & ((*(__IO uint32_t*)(CANx + CAN_RIR_OFFSET_BASE + FIFONumber * 0x10)) >> 21);
  }
  else
  {
    RxMessage->ExtId = (uint32_t)0x1FFFFFFF & ((*(__IO uint32_t*)(CANx + CAN_RIR_OFFSET_BASE + FIFONumber * 0x10))  >> 3);
  }
  
  RxMessage->RTR = (uint8_t)0x02 & (*(__IO uint32_t*)(CANx + CAN_RIR_OFFSET_BASE + FIFONumber * 0x10)) ;
  /* Get the DLC */
  RxMessage->DLC = (uint8_t)0x0F & (*(__IO uint32_t*)(CANx + CAN_RDTR_OFFSET_BASE + FIFONumber * 0x10)) ;
  /* Get the FMI */
  RxMessage->FMI = (uint8_t)0xFF & ((*(__IO uint32_t*)(CANx + CAN_RDTR_OFFSET_BASE + FIFONumber * 0x10)) >> 8);
  /* Get the data field */
  RxMessage->Data[0] = (uint8_t)0xFF & (*(__IO uint32_t*)(CANx + CAN_RDLR_OFFSET_BASE + FIFONumber * 0x10));
  RxMessage->Data[1] = (uint8_t)0xFF & ((*(__IO uint32_t*)(CANx + CAN_RDLR_OFFSET_BASE + FIFONumber * 0x10)) >> 8);
  RxMessage->Data[2] = (uint8_t)0xFF & ((*(__IO uint32_t*)(CANx + CAN_RDLR_OFFSET_BASE + FIFONumber * 0x10)) >> 16);
  RxMessage->Data[3] = (uint8_t)0xFF & ((*(__IO uint32_t*)(CANx + CAN_RDLR_OFFSET_BASE + FIFONumber * 0x10)) >> 24);
  RxMessage->Data[4] = (uint8_t)0xFF & (*(__IO uint32_t*)(CANx + CAN_RDHR_OFFSET_BASE + FIFONumber * 0x10));
  RxMessage->Data[5] = (uint8_t)0xFF & ((*(__IO uint32_t*)(CANx + CAN_RDHR_OFFSET_BASE + FIFONumber * 0x10)) >> 8);
  RxMessage->Data[6] = (uint8_t)0xFF & ((*(__IO uint32_t*)(CANx + CAN_RDHR_OFFSET_BASE + FIFONumber * 0x10)) >> 16);
  RxMessage->Data[7] = (uint8_t)0xFF & ((*(__IO uint32_t*)(CANx + CAN_RDHR_OFFSET_BASE + FIFONumber * 0x10)) >> 24);
  /* Release the FIFO */
  /* Release FIFO0 */
  if (FIFONumber == CAN_FIFO0)
  {
    CAN_RF0R(CANx) |= CAN_RF0R_RFOM0;
  }
  /* Release FIFO1 */
  else /* FIFONumber == CAN_FIFO1 */
  {
    CAN_RF1R(CANx) |= CAN_RF1R_RFOM1;
  }
}

/**
  * @brief  Releases the specified FIFO.
  * @param  CANx:       where x can be 1 or 2 to to select the CAN peripheral. 
  * @param  FIFONumber: FIFO to release, CAN_FIFO0 or CAN_FIFO1.
  * @retval None.
  */
void CAN_FIFORelease(uint32_t CANx, uint8_t FIFONumber)
{
  /* Release FIFO0 */
  if (FIFONumber == CAN_FIFO0)
  {
    CAN_RF0R(CANx) |= CAN_RF0R_RFOM0;
  }
  /* Release FIFO1 */
  else /* FIFONumber == CAN_FIFO1 */
  {
    CAN_RF1R(CANx) |= CAN_RF1R_RFOM1;
  }
}

/**
  * @brief  Returns the number of pending messages.
  * @param  CANx:       where x can be 1 or 2 to to select the CAN peripheral.
  * @param  FIFONumber: Receive FIFO number, CAN_FIFO0 or CAN_FIFO1.
  * @retval NbMessage : which is the number of pending message.
  */
uint8_t CAN_MessagePending(uint32_t CANx, uint8_t FIFONumber)
{
  uint8_t message_pending=0;

	if (FIFONumber == CAN_FIFO0)
  {
    message_pending = (uint8_t)(CAN_RF0R(CANx)&(uint32_t)0x03);
  }
  else if (FIFONumber == CAN_FIFO1)
  {
    message_pending = (uint8_t)(CAN_RF1R(CANx)&(uint32_t)0x03);
  }
  else
  {
    message_pending = 0;
  }
  return message_pending;
}


/**
  * @brief   Select the CAN Operation mode.
  * @param CAN_OperatingMode : CAN Operating Mode. This parameter can be one 
  *                            of @ref CAN_OperatingMode_TypeDef enumeration.
  * @retval status of the requested mode which can be 
  *         - CAN_ModeStatus_Failed    CAN failed entering the specific mode 
  *         - CAN_ModeStatus_Success   CAN Succeed entering the specific mode 

  */
uint8_t CAN_OperatingModeRequest(uint32_t CANx, uint8_t CAN_OperatingMode)
{
  uint8_t status = CAN_ModeStatus_Failed;
  
  /* Timeout for INAK or also for SLAK bits*/
  uint32_t timeout = INAK_TIMEOUT; 

